INDUSTRY_MAP = {

    "AI": [
        "데이터센터",
        "반도체",
        "HBM",
        "GPU",
        "서버",
        "냉각"
    ],

    "데이터센터": [
        "전력",
        "변압기",
        "전력기기",
        "전선",
        "ESS",
        "냉각",
        "발전"
    ],

    "전력": [
        "변압기",
        "전력기기",
        "전선",
        "송전",
        "배전"
    ],

    "변압기": [
        "전력기기",
        "송전",
        "배전"
    ],

    "반도체": [
        "HBM",
        "패키징",
        "검사장비",
        "기판",
        "소재"
    ],

    "HBM": [
        "본딩",
        "패키징",
        "검사장비",
        "반도체"
    ],

    "냉각": [
        "액침냉각",
        "공조",
        "칠러",
        "열관리"
    ],

    "우주항공": [
        "위성",
        "위성통신",
        "발사체"
    ],

    "위성통신": [
        "저궤도위성",
        "안테나",
        "통신장비"
    ],

    "자율주행": [
        "ADAS",
        "전장",
        "센서",
        "카메라",
        "라이다"
    ],

    "방산": [
        "미사일",
        "레이더",
        "항공전자",
        "드론"
    ],

    "원전": [
        "SMR",
        "발전",
        "터빈",
        "원자로"
    ]
}
